coc = '''
<p>파이콘 한국(이하 파이콘)은 커뮤니티 주관으로 이뤄지는 비영리 개발자 대상 행사로, 오픈소스 프로그래밍 언어인 파이썬의 저변 확대와 커뮤니티 활성화를 위해 진행하는 행사입니다.</p>
<p>우리는 이 행사에 참여하는 모든 파이썬 커뮤니티의 참여를 소중히 여기며, 모든 참석자 분들이 즐겁고 만족스러운 시간을 보내시기를 바랍니다. 이를 위해 모든 참석자 분들에게 행사 기간 동안 공식적/비공식적으로 모든 행사의 다른 참석자 분들을 존중하고 서로 예의있게 대해주실 것을 부탁드립니다.</p>
<p>사안들을 명확하게 하기 위해 모든 참석자, 발표자, 전시 참여자, 운영자와 자원봉사자는 모든 파이콘 행사에서 아래의 성명서를 따르셔야 함을 알려드립니다. 운영자들은 행사 기간동안 성명서의 내용을 시행할 것입니다.</p>

<h2>요약</h2>
<ul>
  <li>파이콘은 모든 분들이 성별, 성적 지향, 장애, 외모, 신체 사이즈, 인종, 종교에 상관없이 컨퍼런스에 참여하실 수 있도록 최선의 노력을 다하고 있으며 어떤 형태의 차별도 허용하지 않고 있습니다.</li>
  <li>모든 의사소통은 다양한 배경을 가진 전문적인 청중에게 적합한 것이어야 합니다. 성적인 언어나 묘사는 대화를 포함해서 컨퍼런스의 장소 어디에서든 허용되지 않습니다.</li>
  <li>다른 사람을 존중해 주십시오. 다른 참석자들을 모욕하거나 상처주지 마십시오. 전문가답게 행동하십시오. 차별이나 성희롱, 인종차별, 공격적인 농담은 파이콘에서 허용되지 않습니다.</li>
  <li>이러한 규칙을 어기는 참석자들은 운영진의 재량에 의해 행사에 더 이상 참석하실 수 없으며, 참가비용은 환불해드리지 않습니다.</li>
  <li>모두에게 즐겁고 친근한 행사를 만드는데 협조해주셔서 감사드립니다.</li>
</ul>

<h2>자세한 설명</h2>
<ul>
  <li>성별, 성적 지향, 장애, 외모, 신체사이즈, 인종, 종교, 공개장소에서 성적인 묘사, 고의적인 협박, 스토킹, 차별적인 사진이나 영상, 지속적인 행사를 방해, 부적절한 신체접촉 등 모든 공격적인 언행 및 행동은 공격적인 행동으로 간주합니다.</li>
  <li>누구라도 공격적인 행동을 한 사람은 그 행동을 중지해야 하며 운영진의 요청에 즉시 따라야 합니다.</li>
  <li>발표장의 전시자들이나 스폰서, 부스 운영자 또는 모든 작은 활동 등은 차별 금지 정책에 따라야 합니다. 특히, 전시자들은 성적 묘사, 행동 또는 다른 자료들을 사용할 수 없습니다. 자원봉사를 포함한 부스 운영자들은 외설적인 옷이나 유니폼, 복장을 입거나 다른 성적인 상황을 만들어서는 안됩니다.</li>
  <li>사용하는 단어에 유의해 주십시오. 성희롱, 인종차별, 공격적인 농담은 주위 사람들에게 공격적으로 느껴질 수 있습니다. 지나친 언행이나 공격적인 농담은 파이콘에 어울리지 않습니다.</li>
  <li>참석자가 성명서에 위배되는 행위를 한다면, 운영진은 그 행위를 한 사람에게 경고를 하거나 환불 없이 컨퍼런스에서 추방하는 등 필요한 행동을 취할 것입니다.</li>
</ul>

<h2>연락처</h2>
<p>당신에게 어떤 문제가 발생하거나 다른 분들이 문제에 처한 것을 보셨거나, 불편 사항이 있으시다면 운영진에게 알려주십시오. 운영진은 ‘PyCon Staff’ 티셔츠를 입고 있을 것입니다. 긴급한 사안에 대해서는 가까운 운영진에게 도움을 구한 후, 아래의 담당자에게 연락 부탁드립니다.</p>
<ul>
  <li><strong>김애영</strong> / iiogmgo@pycon.kr</li>
  <li><strong>김원</strong> / cmygray@pycon.kr</li>
</ul>
<p>행사 준비위원회와 자원봉사자들은 참석자들이 행사 기간 동안에 안전하게 참여하실 수 있도록 행사 장소의 보안직원 또는 지역 치안 담당자와의 연결을 지원해 드리는 등 최대한 도움을 드릴 수 있습니다.</p>

<h2>라이센스</h2>
<p>이 성명서는 Ada Initiative와 다른 자원봉사자들에 의해 작성된 Geek Feminism wiki의 정책 예시를 기본으로 하여 작성되었습니다. 원문은 Creative Commons Zero 라이센스를 따르고 있습니다.</p>
'''

sponsor_levels = [
    {
        'name': '다이아몬드',
        'code': 'diamond',
        'mode': 'full',
        'sponsors': [
            {
                'name': '뱅크샐러드',
				'img': 'banksalad.svg',
				'desc': '''기술이 금융을 바꿀 수 있을까요? 뱅크샐러드는 ’우리’의 금융을 바꿔나가는 서비스입니다. 뱅크샐러드는 지문 인증만으로 나의 모든 금융 자산을 한눈에 볼 수 있고, 평소에 알기 어려웠던 신용점수를 실시간으로 확인할 수 있도록 돕습니다. 또한 혜택 계산이 복잡해 비교하기 어려웠던 카드, 일일이 서류를 제출하며 금리를 확인할 수 없어 비교가 어려웠던 대출 등 다양한 금융상품을 데이터를 통해 정직하게 추천합니다.
금융사가 아닌 사용자를 위한 서비스를 만든 결과, 출시 1년 만에 180만 명이 넘는 사용자가 선택한 서비스가 되었습니다. 이제는 나아가 수십억 건의 금융 데이터를 활용해 그동안 깜깜했던 금융의 많은 영역을 밝혀 나가려 합니다. 우리의 신용점수는 어떻게 결정되는 걸까요? '정말로' 나를 위해 조언해주는 금융비서가 가능한 걸까요? 기술과 데이터로 금융의 장벽을 낮추는 여정에 여러분과 함께하고 싶습니다.''',
            },
            {
                'name': '하이퍼커넥트',
                'img': 'hyperconnect.svg',
                'desc': '''"하이퍼커넥트는 전 세계 2억 다운로드를 기록한 앱 '아자르'와 함께 매출의 90% 이상을 해외에서 거두며 고속성장을 이어가고 있는 영상 기술 기업입니다. 아자르는 국가, 언어, 성별, 문화의 장벽을 넘어 다양한 사람들을 만나고, 서로의 삶과 문화를 이해하며 새로운 즐거움을 경험할 수 있는 비디오 기반 소셜 플랫폼으로, 현재 전 세계 230개국에서 19개 언어로 서비스되며 매일 6천만 건의 새로운 연결을 만들어내고 있습니다. 
하이퍼커넥트는 자체 기술 개발을 중시하고, 혁신 기술을 기반으로 제품을 만들어가는 Technology-Driven Company 입니다. WebRTC를 모바일에 최초로 적용하여 탄생한 '아자르'를 시작으로, 머신러닝 기반의 이미지·영상분석 등 최신 기술을 빠르게 도입하고 있습니다. 또한, 차세대 프로덕트 개발 스튜디오인 하이퍼X를 통해 기술기반 아이디어를 끊임없이 테스트하며 글로벌 시장에 대한 도전을 지속하고 있습니다.
하이퍼커넥트는 이러한 도전의 과정에서 다양한 분야에 Python을 활용하고 있습니다. 자체적인 툴 개발부터 머신러닝 연구, 방대한 데이터 분석 파이프라인 구축, 새로운 서비스의 빠른 개발, 그리고 일상의 소소한 귀찮음을 해결해주는 여러 가지 자동화까지. Python은 거의 모든 엔지니어링 업무에서 활약하고 있습니다. 하이퍼커넥트는 앞으로도 Python, 그리고 Python 커뮤니티와 함께 성장해갈 수 있기를 기대합니다."''',
            },
        ],
    },
    {
        'name': '사파이어',
        'code': 'sapphire',
        'mode': 'full',
        'sponsors': [
            {
                'name': '루닛',
                'img': 'lunit.svg',
                'desc': '''"“Perfecting Intelligence. Transforming Medicine.”
우리가 알고있는 인체에 대한 지식은 매우 제한적이기 때문에 현재의 의학적 진단은 완벽하지 않습니다.
하지만 병원에 쌓여있는 대규모 데이터를 학습한 AI가 도움을 준다면, 우리는 더 완벽에 가까운 의학적 진단을 받을 수 있을 것입니다.
데이터를 모으고 정제하는 부분부터 Deep Learning Model을 구현하고 학습시키며 제품화로 연결되는, 의학 AI를 만들기 위한 모든 과정에 Python이 사용되고 있습니다.
이를 통해 루닛은 세계에서 가장 정확한 의학 AI들을 만들어내었습니다.
현재 흉부엑스선, 유방촬영술 영상과 병리 분야의 AI를 만들고 있고, 이들은 세계 최고의 영상의학 학회나 여러 병리 AI 세계대회에서 인정받았습니다.
루닛은 이번 파이콘 한국 2018에서 한국의 Python Community에 그동안의 경험을 공유하고 피드백을 받아 지금보다 더 나은 의학을 만들기 위해 함께 고민하고자 합니다."''',
            },
        ],
    },
    {
        'name': '플래티넘',
        'code': 'platinum',
        'mode': 'full',
        'sponsors': [
            {
                'name': '알지피코리아',
                'img': 'rgpkorea.svg',
                'desc': '''요기요, 배달통, 푸드플라이를 서비스하고 있는 알지피코리아는 Restaurant Growth Partner로서 고객에게는 맛있는 즐거움을, 사장님에게는 사업 성장의 기회를 제공하고 있는 국내 대표 O2O 기업입니다.

알지피코리아는 5개 대륙 40여개국 글로벌 네트워크를 보유한 독일 상장사 '딜리버리히어로(Delivery Hero)'의 한국 네트워크로 전 세계 글로벌 서비스의 노하우를 함께 공유해 선진화된 주문배달 서비스를 제공해 나가고자 끊임없이 노력해 나가고 있습니다.

지난 2011년 설립된 알지피코리아는 창립 7년 만에 직원 수 600여명, 매출 1,000억원대의 기업으로 성장했습니다. 현재도 지속적으로 빠른 성장 중이며, 더 나은 서비스를 제공해 나가기 위해 최선을 다하고 있습니다.

알지피코리아는 현재 Agile 방법론에 기반한 유연하고 역동적인 Product과 개발 문화를 보유하고 있으며, Python 플랫폼으로는 국내 최대 규모의 서비스를 제공 중입니다. 딜리버리 히어로의 글로벌 서비스들과 MSA component는 물론 개발자 교환 프로그램 등을 통해서도 기술 노하우를 서로 공유하며 다함께 전 세계의 주문배달 산업을 선도해 나가고 있습니다.''',
            },
            {
                'name': '패스트캠퍼스',
                'img': 'fastcampus.svg',
                'desc': '''패스트캠퍼스는 현재 한국에서 유일하게 데이터사이언스, 프로그래밍, 마케팅, 크리에이티브, 파이낸스, 비즈니스, 외국어 등의 성인 실무교육 전 분야를 커버합니다. 특히, Python을 기반으로 한 데이터 분석, 머신러닝, 딥러닝 과정부터 프로그래밍 과정까지 끊임없이 컨텐츠를 늘려가고 있습니다. 분야 전문가들과 함께 소통하며, 새로운 연구 트렌드와 실무자들의 고충을 해결할 커리큘럼을 만들고자 노력하고 있습니다.

우리는 대다수의 한국 성인들이, 대학에서 배운 것을 실무에서 써먹지 못하고 있는 빠른 세상 변화에 대응하기 위한 여러 분야의 학습 니즈를 해소하는 것을 큰 기회로 생각합니다. 패스트캠퍼스를 찾아오는 분들께 단순한 교육기관을 넘어서서, Life Accelerator가 되려고 합니다.

이번 PyCon Korea 2018을 통해 Python 관련 분야에 열정과 관심을 가진 분들과 상호작용하며 Python Community의 발전에 기여할 수 있기를 기원합니다.''',
            },
            {
                'name': '구글',
                'img': 'google.svg',
                'desc': '''
                "Google Developer Group(GDG)는 구글의 기술을 사용하고 있거나 혹은 관심을 가지고 학습하는 개발자들에 의해 자발적으로 운영되는 커뮤니티입니다. 안드로이드, 웹, 파이어베이스, 텐서플로우, 구글 클라우드 플랫폼, VR 등 구글의 주요 기술에 대해 다루고 있으며 모든 개발자 분들이 더 즐겁고 다양한 프로그램을 연구/개발하실 수 있도록 활동하고 있습니다.
현재 전세계적으로 104개 나라에 총 573개 GDG 커뮤니티가 활동중이며 국내에는 14개의 GDG(Busan, Campus Korea, Cloud Korea, Daejeon, Gwangmyeong, Incheon, Korea Android, Korea WebTech, Pangyo, Seoul , Songdo, Suwon, Ulsan)가 활발하게 운영되고 있습니다.
열정적인 개발자들이 많은 아이디어를 나누며 동료 개발자들과 즐겁게 네트워킹 하고 있습니다. Google에 관련된 기술과 개발툴들 컨텐츠에 집중되어 있지만 모든 개발 분야에 대해서도 자유롭게 열려있습니다. 배우고자 하는 열정이 가득한 개발자들의 커뮤니티에 여러분들을 초대합니다.
GDG의 멤버가 되어주세요!
Slack : http://slack.gdg.kr/
Facebook : https://facebook.com/gdgkorea/"'''
            },
            {
                'name': '아산나눔재단',
                'img': 'asan.svg',
                'desc': '''“할 수 있다고 생각하면 이룰 수 있는 세상”

아산나눔재단은 고(故) 아산 정주영 현대 창업자의 서거 10주기를 기념해 2011년 10월 출범한 공익재단입니다. 아산나눔재단은 우리 사회에 아산의 창조 정신을 계승한 ‘기업가정신(起業家精神; Entrepreneurship)’ 확산을 위해 사회 전반에서 다양한 방식의 지원 사업을 진행합니다.
아산나눔재단은 더 나은 세상으로의 변화를 이끄는 사람과 기관을 양성해 사회발전을 이루고자 ‘할 수 있다고 생각하면 이룰 수 있는 세상’이라는 비전을 세웠습니다.
이러한 비전 아래 청년 창업가와 사회혁신가가 도전하고, 성장하고, 나누는 기반을 만들고자 합니다. 이를 위해 기업가정신 교육 사업, 청년 창업 지원 사업, 비영리 역량강화 사업 등을 활발히 펼쳐나가고 있습니다.''',
            },
        ],
    },
    {
        'name': '골드',
        'code': 'gold',
        'mode': 'half',
        'sponsors': [
            {
                'name': 'ICON',
                'img': 'icon.svg',
                'desc': '''ICON 프로젝트는 Hyperconnect the World의 비전 아래 다양한 블록체인 커뮤니티를 연결하여 블록체인 기술이 현실 생활에 사용되는 환경을 구축하고 있는 글로벌 프로젝트입니다.
ICON의 핵심 블록체인 엔진인 loopchain은 자체 개발한 고성능 블록체인 엔진으로 세계최초 블록체인 공동인증서비스인 ChainID, 블록체인 기반 보험금 자동청구 서비스 등 다양한 기업, 컨소시엄, 정부 주도 사업에 사용되고 있으며, 데모데이 행사, 교육프로그램, 엑셀러레이팅 지원 등 블록체인으로 세상이 연결되며 시너지를 창출하는 생태계를 만들고 있습니다.
ICON과 함께 블록체인으로 세상을 연결할 개발자분들을 모집하고 있으니 많은 관심 부탁드립니다.
hello@icon.foundation''',
            },
            {
                'name': '리디 주식회사',
                'img': 'ridi.svg',
                'desc': '''리디 주식회사는 전자책 업계의 독보적인 선두 기업입니다.
차량이 자율주행차로, 시계가 스마트워치로 진화하는 등 스마트 기기가 일상에 자리잡은 가운데, 우리는 독서의 새로운 양상을 제시하며 독서 인구의 확장에 주력합니다.
국내 최초 스마트폰 전자책 서비스 리디북스는 폭넓은 분야의 풍성한 도서 콘텐츠를 즐길 수 있는 플랫폼이며, 대표적 무제한 도서 월정액제 리디셀렉트는 도서 콘텐츠 시장에 활력을 불어넣고 있습니다.
페이퍼는 리디 주식회사의 자체 개발 전자책 단말기로, 뛰어난 UX, 더 나은 독서 경험을 제공합니다.
다년 간 R&D에 주력한 결과, 리디 주식회사는 똑똑한 IT 기업, 가장 우수한 전자책 서비스를 제공하는 기업으로 성장했습니다. PyCon을 통해 더 많은 사람들과 우리의 경험을 나누려 합니다.''',
            },
            {
                'name': '센드버드',
                'img': 'sendbird.svg',
                'desc': '''센드버드는 세계에서 가장 확장성 높은 채팅 솔루션을 제공하는 실리콘밸리의 SaaS스타트업입니다.  
 한국 출신 스타트업으로는 최초로 미국의 유명 테크 지원기관인 와이콤비네이터(Y Combinator)와 &lt;Techstars&gt; 모두에서 투자를 유치했으며, 최근 실리콘밸리에서 메가시리즈 A펀딩에 성공한 사실상 최초의 한인 스타트업으로 알려졌습니다. 
우리는 글로벌 고객에게 채팅 서비스의 초대용량 트래픽을 감당할 수 있는 서버 구성과 다양한 웹서비스를 위해 모든 분야에 파이썬을 사용하고 있습니다. 
기술과 문화의 다양성을 존중하는 파이썬 커뮤니티를 응원하며, 파이콘 한국 2018을 통해 좋은 상호작용 할 수 있기를 기대합니다.''',
            },
            {
                'name': '라인',
                'img': 'line.svg',
                'desc': '''LINE은 전 세계 8개의 국가에서 5,600명이 넘는 직원들이 함께 일하는 글로벌 기술 기업입니다.

LINE은 세계 각국의 사용자를 대상으로 2억명 이상의 사용자를 가진 메신저 뿐 아니라 블록체인, 금융, 뉴스, 비디오, 만화, 블로그 등 다양한 서비스를 제공합니다. 또한 LINE은 Python을 인프라 관련 뿐 아니라 블록체인, 데이터처리, AI등 다양한 업무에서 광범위하게 활용하고 있으며 2015년부터 PyCon을 후원하고 있습니다.

* LINE 엔지니어링 - https://engineering.linecorp.com/ko
* 개발자 지원하기 - https://recruit.linepluscorp.com/lineplus/career/list?classId=148''',
            },
            {
                'name': '스포카',
                'img': 'spoqa.svg',
                'desc': '''스포카(https://spoqa.com)는<br>매장과 고객을 세련되게 연결한다는 사명 아래 소상공인에게 도움이 되는 서비스를 만드는 회사입니다. 2012년 태블릿 기반의 적립 서비스 도도 포인트를 론칭, 현재까지 1만여 매장과 1,600만 사용자를 연결하여 업계 1위를 지키고 있습니다.
또한 오프라인 데이터 기반 블록체인인 캐리 프로토콜(https://carryprotocol.io)의 파트너사로써, 결제 데이터를 사용자의 입맛에 맞게 블록체인에 올려 가치를 창출하는 것을 돕고 있습니다.
도도 포인트 론칭부터 지금에 이르기까지, 저희가 파이썬을 사용해오면서 느낀 가장 큰 장점은 훌륭한 커뮤니티라고 생각합니다. 파이콘 한국 2018 참여로 스포카가 앞으로 더 나은 커뮤니티를 만드는 데에 도움이 되기를 바랍니다.''',
            },
            {
                'name': '코인원',
                'img': 'coinone.svg',
                'desc': '''코인원은 블록체인 기술을 활용해 미래금융을 만들어나가는 회사입니다. 
현재 국내 최대 규모의 암호화폐 거래소를 운영하고 있고, 해외송금 서비스 크로스(Cross)의 오픈을 준비하고 있죠. 최근에 암호화폐 거래소 사업을 인도네시아로 확장하며 세계로 나아가기 시작했어요. 원칙과 소신을 지키며 건전한 블록체인 생태계를 만들어나가는 코인원의 미래, 많은 기대 바랍니다.''',
                'code': '''
from coinone.job_fields \\
    import Developer

new_member = Developer(
    when=pycon_2018,
    who=you,
    skill=what_you_have,
    love=blockchain
).join()

new_member.accomplish_dream()

print('Welcome to Coinone!')
''',
            },
            {
                'name': 'JetBrains',
                'img': 'jetbrains.svg',
                'desc': '''JetBrains는 지능형 IDE 및 협업툴을 개발하는 소프트웨어 개발사 이며, 프라하(체코)에 본사를 두고, 러시아, 독일 및 미국에 지사를 운영하고 있습니다.
JetBrains의 700명 이상의 직원들은 JAVA 생산성 향상 IDE인 IntelliJ IDEA 및 .NET 개발툴 Rider를 주력으로 한국 시장을 공략하고 있으며, Python IDE 로는 PyCharm 을 제공하고 있습니다. 또한, 포춘 100대 기업 중 95개 기업이 JetBrains 의 IDE를 사용하고 있습니다.
IT 업계는 시장 경쟁이 치열하며, 발빠른 시장 선점이 성공 비결의 핵심입니다. JetBrains 의 제품들은 프로그래머들이 불필요한 시간을 낭비하지 않도록 하여 기업의 생산성을 높이는데 획기적인 도움을 주고 있습니다.
www.jetbrains.com''',
            },
            {
                'name': '래블업',
                'img': 'lablup.svg',
                'desc': '''래블업 (https://www.lablup.com)은 'Make AI Accessible'을 모토로 인공지능 기술을 누구나 쉽고 빠르게 사용할 수 있게 해주는 플랫폼을 개발하는 스타트업 입니다.
래블업이 개발하여 서비스 중인 Backend.AI (https://www.backend.ai)는 슈퍼 컴퓨터/서버 같은 장비나 복잡한 개발 환경 설정에 신경 쓸 필요 없이 인공지능 개발에만 집중할 수 있도록 돕는 분산형 머신러닝 오케스트레이션 프레임워크로, 온프레미스 솔루션과 클라우드 서비스를 제공하고 있습니다.
또한 래블업은 강력한 학습 관리 기능을 갖춘 온라인 실습형 코딩 교육 서비스인 코드온웹 (https://www.codeonweb.com) 을 개발하여 대학교 등 교육 기관에 공급하고 있습니다.''',
            },
            {
                'name': 'ODK Media, Inc.',
                'img': 'odkmedia.svg',
                'desc': '''ODK Media, Inc.는 2011년 11월 MIT에서 인큐베이션을 거쳐 2012년 3월 북미에서 OnDemandKorea라는 이름으로 정식 서비스를 시작한 미디어 스트리밍 스타트업입니다. 국내외 메이저 방송사와의 파트너십을 통해 한국 콘텐츠를 세계로 전달하고 있으며 160만명의 사용자들이 파이썬으로 만든 서비스를 사용하고 있습니다.
“Come for the language, Stay for the community” 처럼 ODK Media 역시 서비스 기술 스택으로 파이썬을 선택했었고 이제는 한국 파이썬 커뮤니티의 일부가 되어 5회를 맞는 파이콘 한국 2018에 후원기업으로 함께 하게 되어 기쁘게 생각합니다.
행사 기간동안 부스에서 한국 파이썬 개발자 설문조사를 진행할 예정이니 많은 참여 바랍니다.''',
            },
            {
                'name': 'Elastic',
                'img': 'elastic.svg',
                'desc': '''Elastic은 실시간 검색, 데이터 분석, 로깅에 널리 사용되는 Elastic Stack - Elasticsearch, Kibana, Logstash, Beats 를 오픈소스로 개발하여 제공하고 있으며 전 세계 유수의 기업과 조직에서 다양하게 사용되고 있습니다. Restful API를 기본으로 하여 Python 을 비롯한 다양한 API를 제공하며 어떤 프로그램과도 쉽게 연동되어 다양한 데이터 분석 기능을 수행할 수 있습니다. 또한 머신러닝을 비롯하여 사이트서치, APM 등 다양한 분야로 계속해서 기능을 확장하고 있습니다.

Elastic은 세상을 더 멋진 곳으로 만들기 위해 개발자들을 돕는 것을 항상 기쁘게 생각하며 이번에 전 세계의 다양한 개발자들이 모이는 PyCon 행사를 지원하게 되었습니다.''',
            },
        ],
    },
    {
        'name': '실버',
        'code': 'silver',
        'mode': 'compact',
        'sponsors': [
            {
                'name': '피플펀드',
                'img': 'peoplefund.svg',
                'desc': '''더 나은 개발 문화를 위해 피플펀드는 PyCon과 함께합니다.

피플펀드는 서비스 런칭 후 정말 빠르게 성장하고 있습니다. 이렇게 빠른 성장의 가운데서 여러 가지 고민 또한 있었습니다. 이제 이러한 고민의 결과물을 하나씩 정리해가고자 합니다. 그 시작점에서, 좋은 개발 문화에 대한 피플펀드의 생각을 나누고자 합니다.

피플펀드 개발팀은 좋은 개발 문화에 대한 답을 찾아가는 중입니다. PyCon을 통해 이러한 고민을 많은 분들과 나누고 싶습니다.''',
            },
            {
                'name': '번개장터',
                'img': 'bunjang.svg',
                'desc': '''번개장터 주식회사는 대한민국 1등 중고거래 앱, '번개장터' 와 대한민국 1등 중고거래 컨시어지 서비스, '셀잇' 을 운영하고 있습니다. 
번개장터는 1천만 명 이상이 다운로드했으며, 매월 300만 명 이상이 이용하는 서비스를 Python으로 개발해 나가고 있습니다.
Python의 높은 생산성을 통하여 성장한 만큼 PyCon Korea 2018을 통해 Python Community에 기여하길 기대합니다.''',
            },
            {
                'name': 'HBSmith',
                'img': 'hbsmith.svg',
                'desc': '''HBSmith는 2016년 9월에 창업한 B2B, 서버 장애 모니터링, SaaS 서비스 'hbsmith'를 만드는 기술 스타트업입니다.
'hbsmith' 서비스는 100% Python 3 로 작성된 백엔드 서버들로 운영되고 있으며, 서버 agent 설치나 code 수정 없이 바로 사용 가능한 black box 모니터링 서비스입니다. HBSmith는 앞으로도 다양한 분야에 Python을 활발히 사용할 예정입니다.''',
            },
            {
                'name': '마이뮤직테이스트',
                'img': 'mymusictaste.svg',
                'desc': '''MyMusicTaste는 전 세계 음악팬들의 요청을 기반으로 공연을 만들어 나가는 서비스입니다. 
팬들이 원하면 공연이 이루어져야 한다는 비전아래 지금까지 전세계 60여개의 도시에서 EXO, SHINEE, Dream Theater 등 수많은 아티스트들의 공연들이 성공적으로 이루어졌습니다.
약 30조원 규모의 전 세계 음악 공연 산업을 기술을 통해 변화시켜 나가고 있으며, 15여 개의 언어로 서비스하는 글로벌 스타트업입니다.''',
            },
            {
                'name': '스타트링크',
                'img': 'startlink.svg',
                'desc': '''알고리즘 문제 채점 사이트 백준 온라인 저지 (BOJ)와 온라인 강의 플랫폼 코드 플러스를 운영하고 있습니다.
스타트링크는 Problem Solving 분야를 기반으로 점차 확장해나가고 있습니다. BOJ는 이제 많은 개인/대학/기업 대회를 개최한 대회 플랫폼입니다.
알고리즘의 문턱을 낮추기 위해서 시작한 서비스들은 이제 Python과 함께 코딩의 문턱을 낮추는 방향으로 달려가고 있습니다.
Py(C|th)on을 응원합니다.''',
            },
            {
                'name': '글로우데이즈',
                'img': 'glowpick.svg',
                'desc': '''글로우데이즈는 '소비자 데이터로 화장품 시장을 혁신하는 기업' 입니다.
소비자들의 후기데이터를 통해 가장 신뢰도 높은 화장품 랭킹 정보를 제공하는 글로우픽 앱을  출시하여 현재까지 150만 다운로드, 30만명의 월간 활성사용자, 250만건의 소비자리뷰를 확보했습니다. 굴지의 VC들로부터 누적 60억원 이상의 투자를 유치했으며, 소비자 후기 데이터를 바탕으로 대한민국 화장품 시장을 혁신하는 다양한 비즈니스모델들로 건전하게 성장하고 있습니다.''',
            },
            {
                'name': '위시켓',
                'img': 'wishket.svg',
                'desc': '''위시켓은 성장통을 겪고 있는 국내 IT아웃소싱 시장에서, 기업과 프리랜서에게 더 나은 가치를 전달하기 위한 IT 아웃소싱 플랫폼입니다. 
Python을 기반으로 시작한 위시켓은 4만여 개의 기업, 5만여 명의 프리랜서와 개발 회사가 사용하는 플랫폼으로 성장하고 있습니다. 
앞으로도 Python과 함께 IT 구성원들이 더 행복하게 일할 수 있는 플랫폼을 만들어 나가겠습니다.''',
            },
            {
                'name': '미래에셋대우',
                'img': 'miraeasset.svg',
                'desc': '''미래에셋대우는 고객의 성공적인 투자를 위해 최상의 디지털금융 서비스를 제공하고자 인공지능 기반의 디지털 자산관리솔루션개발에 박차를 가하고 디지털 혁신을 선도하고 있습니다.
특히 빅데이터팀은 오픈소스 기반 분석 플랫폼을 자체적으로 구축하고 파이썬을 적극적으로 활용하여 딥러닝 기반 서비스개발과 데이터 사이언스 업무에 빅데이터를 활용하고 있습니다.
이번 후원을 시작으로 미래에셋대우의 사회공헌을 실천하고 파이콘 한국과 함께 하고자 합니다.''',
            },
        ],
    },
    {
        'name': '커뮤니티',
        'code': 'community',
        'mode': 'compact',
        'sponsors': [
            {
                'name': 'Women Who Code Seoul',
                'img': 'womenwhocode.svg',
                'desc': '''2011년 설립된 위민 후 코드는 전 세계 20개국 60개 도시에서 13만 7천여명의 여성 엔지니어들이 활동하고 있는 비영리 단체입니다. 올해 3월에 시작한 위민 후 코드 서울은 대한민국 IT 업계의 여성들의 활약을 조명하고 네트워킹을 통해 함께 성장할 수 있도록 기회를 만들고자 시작되었습니다. 현재 200여 명의 온라인 회원, 20명의 운영진이 있으며, 더 많은 여성들의 활동 참여를 기다립니다.
https://www.facebook.com/wwcodeseoul/''',
            },
        ],
    },
]

staffs = sorted(['권국헌', '김두훈', '김소연', '김슬', '김애영', '김연태', '김원', '김정환', '나영근', '노세호', '박조은', '박혜정', '배권한', '서승효', '신근우', '오시영', '이유라', '이종서', '정찬모', '조성수', '추교영', '홍연의', ])

volunteers = sorted(['Manoj Pandey', '신정우', '조인태', '김대위', '오형석', '차영호', '김동영', '유지은', '최덕호', '김동은', '윤성수', '최혜선', '김동현', '윤성준', '한진수', '김무훈', '윤종민', '허가온', '김선아', '이규영', '황준오', '김성현', '이새봄', '황현석', '김신제', '이새하', '김온섭', '이수호', '김윤재', '이승우', '김지원', '김현지', '이은용', '도병권', '이지후', '류수영', '이혁주', '박시후', '인상민', '박예진', '장영철', '박재은', '장지창', '사재경', '전병우', '손주영', '전찬훈', '송신예', '정경서', '신은주', '조아라', ])

patrons = [
    'SH',
    '조성수 / 조성수',
    '박현우 / zerobased.co',
    '김정환 / FairBrite.com',
    'Younggun Kim / Python Software Foundation',
    'Dr. Strange / Kamar-Taj',
    '권국헌 / RGP Korea',
    'Hyunjoong Kim',
    '김준기 / 래블업',
    '송달래 / Dalrae / 달랩',
    '이현배',
    'Jaehoon Jeong / Woowa Brothers Corp.',
    '박조은',
    'ganachoco / Knowhere',
    '이진석 / Ask Company',
    '강석천',
    'Edward Kim',
    '신근우 / Bluehole',
    'SSUNNY',
    '배권한 / Python',
    'Imjae Park',
    '신예지 / Korea',
    '박현수 / 집꾸미기',
    '김슬',
    '<img src="images/1f914.png" class="emoji"> / 한국PHP노동자조합',
    '오시영 ohahohah(오아*2) / github.com/ohahohah',
    '김애영 / 리디',
    '김태균 / 개발자스럽다',
    '조아라',
    'chaeplin',
    '황현식 / 밀리만코리아',
    '이종진 / MEGAZONE',
    '박주혁 / F_',
    'zironycho / Neosapience, Inc.',
    '장창완 / 넥슨코리아',
    '徐准石',
    '이주원 / kakao',
    '송영숙 / 경희대',
    '서종화 / 핀코인',
    '최원 / 알지피코리아',
    'Junmo Kang / Huzen Dev. House',
    '조현종 / TadpoleHub',
    'Inwoo Ro / Naver Webtton',
    'Lee Luther / 위즈페이',
    '류재혁 / LH',
    '김승일 / 모두의연구소',
    '이승준 / FinanceData.KR',
    'Jaehoon You / EJN Corp.',
    '이병근 / 네이버',
    '박금집',
    '김국진 / 올라데이터',
    '장홍준',
    '박우환 / 코닉오토메이션',
    'boyeon / theLoop',
    '이성욱 / SPEARHEAD',
    '최병훈',
    '조용진 / 현대오토에버',
    '김재우 / Kakao',
    'JIN XIONGLONG / 넥슨코리아',
    'Minjung Ko / NEXON',
    '이상열 / 캐글뽀개기',
    '최찬환 / 한국디지털미디어고등학교',
    '홍승균 / 한국과학기술정보연구원',
    '송영헌 / 한국과학기술정보연구원',
    '김호용 / 한국과학기술정보연구원',
    '박세호',
    '최용석',
    '정원국 / Mathpresso',
    '남석현 a.k.a. SCONE / BlockchainOS',
    '박민우 / LINE',
    '진주리',
    'Euijun Jeong / SK planet',
    'Sumin Byeon / Coupang',
    '박주경 / 학생',
    '진권휴 / 대구경북과학기술원',
    '석근국 / DILUSSION INC',
    '김현진 / DILUSSION INC',
    '김승모 / DILUSSION INC',
    '이동주 / DILUSSION INC',
    '김광태 / DILUSSION INC',
    '정나리 / 나리 주에리안 (Narie Juerian) / 그래피튠 (Graphitune)',
    '문보현 / 선행플랫폼개발부',
]

keynotes = [
    {
        'title': '그리고 물고기는 고마웠어요',
        'desc': '심리학 전공자들과 간단한 프로그래밍 스터디를 하기 위해 시작했던 시한부의 작은 그룹이, 6년이나 파이썬과 함께 생존하고 성장한 이야기.',
        'date': '8월 18일 오전 9시 40분',
        'speaker': {
            'name': '김무성',
            'bio': '심리학 그룹 싸이그래머에서 재밌는 스터디를 하고 있는 김무성입니다. 파이썬 많이 씁니다. 새로운 것에 관심 많습니다.',
            'photo': 'kimmoosung.jpg',
            'link': 'https://www.facebook.com/groups/psygrammer/',
        },
    },
    {
        'title': 'Why I Learn, How I Learn.',
        'desc': '삽질 덜 하는 자연어처리, 커뮤니티 활동을 통해서 배울 수 있는 것들',
        'date': '8월 18일 오전 10시 30분',
        'speaker': {
            'name': '송영숙',
            'bio': '코딩하는 국문과',
            'photo': 'youngsooksong.jpg',
            'link': 'https://songys.github.io/',
        },
    },
    {
        'title': 'Committing to diversity and inclusion',
        'desc': '전 세계에서 개최되는 파이콘은 운영진, 참가자, 발표자들은 파이썬 소프트웨어 재단의 다양성 성명서를 준수합니다. 이 곳에 있는 우리 모두 역시 ‘다양성(Diversity)’을 지지하는 사람들입니다. 다양성은 오픈 소스 프로젝트, 기술 커뮤니티, 회사, 제품은 물론 우리의 삶 속에서도 녹아 뿌리내려야 합니다. 그러나 단지 다양한 사람들을 한 곳에 모은다고 해서 다양성 문제가 해결되는 것은 아닙니다. 다양한 사람들이 커뮤니티에서 성장의 기회를 갖고 그들을 구성원으로 인정해야 합니다. 즉 ‘포용(Inclusion)’이 있어야 다양성을 비로소 실천할 수 있습니다. 본 발표에서는 장고걸스와 같이 다양성과 포용을 실천하는 파이썬 커뮤니티들이 어떠한 노력을 하는지를 나누고, 더 나아가 다양성을 높이기 위해 우리가 직접 실천하고 구체적으로 할 수 있는 일들을 함께 찾아보고 나누고자 합니다.',
        'date': '8월 18일 오전 11시 20분',
        'speaker': {
            'name': '이수진',
            'bio': '음대에서 작곡을 공부하던 중 파이썬을 접하고 처음 프로그래밍 세계에 빠져들었습니다.  그동안 장고걸스 튜토리얼 번역과 장고걸스 워크샵 운영을 시작으로 여성들의 참여를 통해 IT 업계와 개발 커뮤니티 내 다양성을 높이는데 많은 노력을 기울여왔습니다. 현재 위민 후 서울(Women Who Code Seoul) 커뮤니티를 운영하며 여성들의 IT 업계 진출을 돕고 그들의 도전과 꿈, 열정을 응원하고 함께 성장할 수 있는 기회를 제공하고 있습니다. 서울대학교 융합과학기술대학원 석사 과정 중으로 음악 오디오 연구실에서 웹 오디오와 음악 정보 추출 연구를 하며, 인터렉티브한 음악 웹 애플리케이션을 만들고 있습니다.',
            'photo': 'sujinlee.png',
            'link': 'https://sujinlee.me/',
        },
    },
]

programs = [
    {
        'id': 'sprint',
        'name': '스프린트',
        'date': '8월 15일, 17일',
        'desc': '스프린트는 관심 있는 오픈소스 프로젝트를 같은 장소에 모여 집중적으로 배우고 개발하는 자리입니다. 새로운 동료를 만나고, 오픈소스에서 얻을 수 있는 경험과 지식을 나눌 수 있는 시간 입니다. 처음 참여하신다고요? 문제 없습니다. 해당 프로젝트를 주도적으로 개발하는 분에게 배울 수 있는 시간이 될 것입니다. 스프린트는 파이썬 뿐만 아니라 모든 언어의 오픈소스 프로젝트를 대상으로 진행됩니다.',
    },
    {
        'id': 'tutorial',
        'name': '튜토리얼',
        'date': '8월 17일',
        'desc': '튜토리얼은 초보자들을 위해, 또는 새로운 것을 접하는 사람들을 위해 진행하는 교육 프로그램입니다. 튜토리얼 진행자와 도움을 주는 사람들이 여러분을 기다리고 있습니다. 프로그래밍을 처음 시작하거나 파이썬을 새롭게 시작하는 분들에게 튜토리얼 프로그램을 추천합니다. 별도의 비용이 있고 사전 신청을 하셔야만 참여하실 수 있습니다.',
    },
    {
        'id': 'youngcoder',
        'name': '영코더',
        'date': '8월 18일, 19일',
        'desc': '파이콘 티켓 구매자의 자녀, 조카, 이웃 등을 대상으로 하는 젊은 개발자를 위한 교육 프로그램 입니다. 소프트웨어란 무엇이고, 어떻게 동작하는지, 모두가 사랑하는 ‘파이썬’이라는 언어를 통해 함께 알아봅시다. 파이썬을 활용하여 컴퓨터와 대화하는 방법을 배우게 될 것입니다.  프로그래밍을 전혀 몰라도 상관없습니다. 파이썬의 기초부터 시작하는 과정이며 웹 사이트 및 간단한 게임을 만들어 보면서 이 세상을 이해할 수 있는 더 넓은 시야를 갖게 될 것입니다. 별도의 비용이 있고 사전 신청을 하셔야만 참여하실 수 있습니다.',
    },
    {
        'id': 'babycare',
        'name': '아이돌봄',
        'date': '8월 18일, 19일',
        'desc': '아이와 함께 파이콘에 참가하셨나요? 육아로 인해 파이콘에 참여가 어려운 분들을 위해 ‘아이돌봄’을 운영합니다. 전문 업체에서 관리하며 신청자에 한해 미취학아동을 대상으로 제공됩니다. 별도의 비용이 있고 사전 신청이 필요합니다.',
    },
    {
        'id': 'lightningtalk',
        'name': '라이트닝 토크',
        'date': '8월 18일, 19일',
        'desc': '''라이트닝 토크는 그날의 프로그램이 모두 끝나고, 모든 참석자가 모여 5분 이내의 가벼운 이야기를 하는 행사입니다. 라이트닝 토크는 아래와 같은 주제로 이야기됩니다.
      <ul>
        <li>발표하기엔 조금 부담스럽지만 공유해보고 싶은 이야기들</li>
        <li>IT와 관련된 재미난 경험들</li>
        <li>대나무숲처럼 말해버리고 싶은 하소연들</li>
        <li>그 외 뭐든 사람들과 나누고 싶은 이야기들</li>
      </ul>''',
    },
    {
        'id': 'openspace',
        'name': '열린공간',
        'date': '8월 18일, 19일',
        'desc': '열린공간은 원하는 주제나 아이디어에 대해서 참가자들끼리 자유롭게 모여 이야기하는 프로그램입니다. 파이콘은 다양한 열린공간을 제안하기 위한 현황판과 열린공간을 열기 위한 방을 제공하고 있습 니다. 열린공간에는 사전 신청할 필요 없이 파이콘 한국 참가자라면 누구나 자유롭게 참석하실 수 있습니다.',
    },
    {
        'id': 'activities',
        'name': '체육시간',
        'date': '8월 18일, 19일',
        'desc': '계속해서 세션만 들으면 졸리고 피곤하죠? 파이콘 한국에서는 컴퓨터를 장시간 사용하는 프로그래머들을 위한 스트레칭 프로그램을 운영합니다. 20분 정도의 가벼운 운동으로 활력을 되찾아보세요. 파이콘 한국 참가자라면 누구나 사전 예약 또는 현장에서 신청하여 참석하실 수 있습니다.',
    },
]

session_categories = [
    {
        'name': 'Python Library',
        'sessions': [
            {
                'name': 'Ring: 프로그래밍 언어와 가까운 캐시 인터페이스',
                'speaker': '정윤원',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '101',
                'level': 2,
                'desc': 'Ring은 캐시를 프로그래밍 언어에 가까운 인터페이스로 긴밀하게 통합해 제공하고자 하는 시도입니다. dict, shelve, memcache, redis, diskcache, django 지원이 포함되어 있고 asyncio와 호환됩니다.',
            },
            {
                'name': '신과 함께 파이썬과 함께',
                'speaker': '이태형',
                'date': '8월 19일',
                'time': '13:10 - 13:35',
                'location': '101',
                'level': 1,
                'desc': '신과함께 프로젝트는 많은 양의 CG가 들어간 프로젝트 입니다. 프로젝트를 기간내 완료하기 위해서 개발된 툴의 소개와 아티스트들의 피드백을 받아 개선해 나간 경험을 공유하겠습니다.',
            },
            {
                'name': '나도 할 수 있다 오픈 소스! — setup.py에서 PyPI까지',
                'speaker': '강효준',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '101',
                'level': 1,
                'desc': '오픈 소스로 라이브러리를 처음 만들어서 PyPI에 올리려 하다 보면 어려움을 느낄 수 있습니다. setup.py를 작성하는 방법부터 PyPI에 라이브러리를 올리는 법까지 소개합니다. 각 절차에서 참고하면 좋을 법한 팁도 공유합니다.',
            },
            {
                'name': '이무기: 파이썬으로 만드는 컴파일러',
                'speaker': '이한',
                'date': '8월 19일',
                'time': '14:00 - 14:40',
                'location': '101',
                'level': 3,
                'desc': '컴파일러 구현은 컴퓨터 과학의 축소판 이라는 말이 있습니다. 실제로 코드 최적화를 해주는 컴파일러를 제작하려면 많은 지식과 노력이 필요합니다. 여러 거인의 어깨를 빌려, 파이썬으로 컴파일러를 제작해 봅시다.',
            },
        ],
    },
    {
        'name': 'Development Method with Python',
        'sessions': [
            {
                'name': '파이썬으로 네트워크 장비 테스트 자동화 하기',
                'speaker': '구동수',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '105',
                'level': 2,
                'desc': '개발 경험이 전혀 없던 제가 1년동안 네트워크 자동화 테스트 프레임워크 개발 과정을 통해 얻은 경험을 공유하고자 합니다. 청중은 Python을 통한 네트워크 장비 테스트 방법, 넓게는 CLI 기반의 소프트웨어 테스트 접근 방식에 대한 인사이트를 얻을 수 있을 것으로 예상합니다.',
            },
            {
                'name': 'Divide and Divide: Refactoring code in Python',
                'speaker': 'Niño R. Eclarin',
                'id': 'nreclarin',
                'date': '8월 19일',
                'time': '10:00 - 10:40',
                'location': '105',
                'language': 'English',
                'level': 2,
                'desc': 'This talk aims to give some pointers on how to refactor codes efficiently and assess the impact of refactoring in projects. It also aims to discuss on WHEN to refactor and how to communicate this to managers and stakeholders.',
            },
            {
                'name': '인생은 짧아요, 엑셀 대신 파이썬',
                'speaker': '이승준',
                'id': 'plusjune',
                'date': '8월 18일',
                'time': '15:50 - 16:30',
                'location': '105',
                'level': 2,
                'desc': ' 반복적인 엑셀 데이터 작업을 어떻게 자동화 할 수 있는지 필요한 요소들을 살펴보고자 합니다. 또한, 이메일, 브라우저 자동화, 메신저 알림 등 자동화 요소들과 연계성도 함께 살펴보고, 더 나아가 RPA(로봇 프로세스 자동화)까지 어떻게 연계할 수 있는지 그 가능성과 한계를 살펴봅니다.',
            },
            {
                'name': '우아하게 준비하는 테스트와 리팩토링',
                'speaker': '한성민',
                'id': 'kennethan',
                'date': '8월 19일',
                'time': '11:00 - 11:40',
                'location': '105',
                'level': 1,
                'desc': '삐걱거리는 우리의 코드에 윤활유를 뿌려두고 코드를 아름답게 정리하고, 올바른 테스트 코드를 작성하고, CI를 이용한 Automation Testing의 중요성에 대해 논의합니다.',
            },
            {
                'name': 'gdb와 strace로 Hang 걸린 Python Process 원격 디버깅',
                'speaker': '구영민',
                'id': 'youngminz_kr',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '105',
                'level': 2,
                'desc': '로컬 환경에서는 문제 없이 돌아갔던 Python 프로그램이 원격 서버에서는 아무런 로그 없이 멈춰 버리는 경우 어디서부터 손을 대야 할지 정말 막막합니다. strace와 gdb를 이용해 디버깅하여 원격 리눅스 서버에서 Python Process가 Hang 되어 버리는 문제를 진단하고 해결했던 경험을 공유하려고 합니다.',
            },
            {
                'name': 'Python and Rust (feat block-chain)',
                'speaker': 'Daniel Kim',
                'id': 'elastic7327',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '105',
                'level': 1,
                'desc': '순수 파이썬으로 작성한 블록체인에서의 작업 증명 알고리즘의 문제점을 파이썬과 러스트를 함께 사용하여 개선하는 과정을 공유합니다.',
            },
            {
                'name': '파이썬에서 함수형으로 프로그래밍하기',
                'speaker': '하원호',
                'id': 'haho6629',
                'date': '8월 19일',
                'time': '14:00 - 14:40',
                'location': '105',
                'level': 2,
                'desc': '함수형 패러다임의 소개부터 모나드, 클로저, 고차함수, 리듀스 등 파이썬의 함수형 기능과 함수형 프로그래밍을 도와주는 라이브러리를 살펴본 후, 함수형 패러다임을 적용할 때 발생하는 문제점과 따른 대처방법을 간략히 소개합니다.',
            },
        ],
    },
    {
        'name': 'Data Analytics',
        'sessions': [
            {
                'name': 'Luigi로 Data Pipeline system 구현하기',
                'speaker': '송은우',
                'id': 'songew',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '101',
                'level': 2,
                'desc': '공매도 플랫폼 서비스인 trueshort.com 의 data pipeline 시스템을 luigi 기반으로 구현하면서 얻음 경험을 바탕으로 data pipeline 혹은 ETL 시스템 구현시 best practices와 tip을 공유합니다.',
            },
            {
                'name': 'Topic Modeling & Word Embedding 그리고 화장품',
                'speaker': '이홍주',
                'id': 'lee_hongjoo',
                'date': '8월 19일',
                'time': '13:10 - 13:35',
                'location': '104',
                'level': 2,
                'desc': ' 7만여종의 화장품에 9만여명의 소비자가 남긴 리얼 리뷰 2백만여개의 리뷰를 분석하고 화장품들의 특성과 그 화장품을 이용하는 사람들을 이해하는 과정에 대해 소개합니다. Topic modeling 과 word embedding 기술을 소개하고, 리뷰 데이터를 어떻게 모델링하는지 데모합니다. 그리고 데이터 분석가 또는 프로그래머와, 도메인 전문가 사이에 반복적인 시행착오의 고통을 줄여주기 위한 데이터의 인터렉티브 시각화를 시연합니다.',
            },
            {
                'name': '머신러닝으로 치매 정복하기',
                'speaker': '박세진',
                'id': 'gnoses2',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '104',
                'level': 2,
                'desc': 'MRI 뇌 영상에서 파이썬과 텐서플로우를 이용하여 치매 관련 영역을 찾고, 치매 위험도를 예측하는 알고리즘을 개발하면서 겪은 각종 난관들과 이를 극복한 과정들을 소개합니다.',
            },
            {
                'name': '법률 네트워크 분석: 30년간의 변화 Changes in legal citation network over 30 years',
                'speaker': '김재윤',
                'id': 'suitbread',
                'date': '8월 19일',
                'time': '15:40 - 16:20',
                'location': '104',
                'level': 1,
                'desc': '비개발자가 Python을 배우면서 얼마나 쉽게 법률 데이터를 분석하게 되었는지 사례를 공유합니다. 비록 단순 통계분석이지만, 법률 영역에서도 Python을 활용할 수 있음을 보여드립니다. 연구 내용 뿐만 아니라 비개발자가 Python을 배우면서 느낀 점, 법률 만드는 일과 프로그래밍에 유사성이 있다는 점 등을 말씀드리고자 합니다.',
            },
            {
                'name': 'Understanding of Medical Physics modeling and analysis with python including extension to general case.',
                'speaker': '최경돈',
                'id': 'miakaj',
                'date': '8월 19일',
                'time': '14:50 - 15:30',
                'location': '104',
                'language': 'English',
                'level': 1,
                'desc': 'This presentation consists of two parts: Physical, non-statistical data analysis based on CNAO-built programs / Understanding of data in general, by historical-to-modern examples including machine learning and data science.',
            },
            {
                'name': '땀내를 줄이는 Data와 Feature 다루기',
                'speaker': '박조은',
                'id': 'joeunpark',
                'date': '8월 19일',
                'time': '14:00 - 14:40',
                'location': '104',
                'level': 1,
                'desc': '정제되지 않은 데이터에서 해답을 찾기 위해 우리는 방망이 깍는 노인처럼 데이터를 정제하고 또 정제합니다. 이 땀내나는 과정을 파이썬 표준라이브러리와 Numpy, Pandas, Scipy, Scikit-learn 같은 툴을 사용해서 땀내를 줄여보는 방법을 고민해 봅니다. 그리고 딥러닝 기법과 TensorFlow, Keras에서 지원하는 데이터 전처리 기법에 대해서도 소개합니다.',
            },
        ],
    },
    {
        'name': 'Life / Social',
        'pagebreak': True,
        'sessions': [
            {
                'name': '드론 및 인공위성 영상을 이용한 태양광발전소 입지분석',
                'speaker': '최재현',
                'id': 'jh_choi',
                'date': '8월 18일',
                'time': '16:15 - 16:40',
                'location': '102',
                'level': 2,
                'desc': '태양광 발전소를 설치하는데 있어, 발전량과 효율에 매우 큰 영향을 미치는 음영을 확인하는 것은 매우 중요합니다. 음영은 직접 눈으로 살펴보거나 사진 또는 영상으로 남겨서 볼 수 있습니다. 하지만 지형이나 건물에 따라 판단하기 힘든 곳도 있고, 직접 살펴보지 못하는 부분도 있습니다. 이런 경우에 활용 할 수 있는 드론 및 인공위성영상을 이용한 음영 분석방법에 대해 얘기해보려고 합니다.',
            },
            {
                'name': '진실은 언제나 하나! : Python으로 만나보는 Digital Forensic',
                'speaker': '김동현',
                'id': 'digitalisx99',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '102',
                'level': 1,
                'desc': '디지털 포렌식 기술들은 지난 해 우리에게 많은 영향을 준 "박근혜-최순실 게이트" 부터 최근의 여러 사건에서도 큰 역할을 해오고 있습니다.  디지털 포렌식 수행 과정 속에서 Python을 사용할 수 있는 사례, 여러 문제들을 Python으로 해결한 사례를 공유할 것이며, 이 세션을 통해 대중들의 인식이 향상되고 더 멋진 라이브러리나 생각들이 많이 생겨났으면 합니다.',
            },
            {
                'name': '비전공자에게도 파이썬 잘 가르쳐주는 예쁜 개발자',
                'speaker': '박성우',
                'id': 'codest99',
                'date': '8월 18일',
                'time': '15:50 - 16:15',
                'location': '102',
                'level': 1,
                'desc': '비전공자들을 위한 교육은 기존 코딩교육과는 다르게 진행해야 합니다. 최대한 코딩에 흥미를 유도해야 하며, 실생활에 적용되는 예시를 자주 보여줘야 할 것입니다. 또한, 문법보단 실질적인 문제 해결 능력을 키울 수 있도록 가르쳐야 할 것입니다. 이 세션에서는 비전공자들을 위한 교육 방법을 다양한 Python 예시를 통해 다뤄볼 것입니다. 특히 학생의 관점에서 비전공자의 수준과 관심을 위주로 이야기를 나눌 예정입니다.',
            },
            {
                'name': 'Quantify myself - self 사생활침해',
                'speaker': '이승훈',
                'id': 'freerhein',
                'date': '8월 19일',
                'time': '14:55 - 15:20',
                'location': '102',
                'level': 1,
                'desc': '저는 저를 정량화하는 것에 관심이 많습니다. 4년여간 모은 제가 어떤 사람을 만나는지에 대한 사생활 이벤트 데이터 4,279개를 기반으로 저의 행동패턴과 인맥관계 등을 도출해보았습니다. 네트워크 분석에 대한 개념 설명과 기법을 적용하고 시각화 하는 과정을 설명합니다.',
            },
            {
                'name': '비개발자에게 파이썬 가르치기',
                'speaker': '문석환',
                'id': 'seokhwan',
                'date': '8월 19일',
                'time': '13:10 - 13:35',
                'location': '105',
                'level': 1,
                'desc': '개발팀에 속해있는 한 명의 개발자로써, “타부서와의 커뮤니케이션 효율화 증대”라는 원대한 꿈을 위해 비개발자들에게 프로그래밍을 가르쳤던 경험을 공유하고자 합니다. 왜 다른 언어가 아닌 파이썬을 사용했는지, 수업을 하면서 맞닥뜨렸던 어려움들 어떤 것들이 있었는지, 그리고 이를 해결하기 위해 사용한 방법들은 무엇이 있었는지에 대해 공유합니다.',
            },
            {
                'name': '생활탐사: 파이썬으로 일상에 도움 되는 뉴스 만들기',
                'speaker': '강종구',
                'id': 'jonggu_me',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '102',
                'level': 1,
                'desc': '파이썬은 ‘생활 탐사’ 보도를 위한 매우 강력한 툴입니다. 종이 신문사의 파이썬 + 데이터 저널리스트는 무슨 일을 할까요? 사회의 거대한 뉴스를 보도하는 동료 기자 사이에서 어떤 차별성을 가질까요? 어떤 도구를 사용해, 어떤 방식으로 뉴스를 생산할까요?',
            },
            {
                'name': 'Dive Into 파이써니스쿨 - 2020년, 만약 모든 과목 선생님들이 파이썬을 배운다면?',
                'speaker': '송석리',
                'id': 'greatsong21',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '102',
                'level': 1,
                'desc': '저는 고등학교에서 파이썬을 가르치는 선생님입니다. 제가 선생님을 시작한 선린인터넷고등학교에서 학생들에게 영감을 받아 파이썬을 정규 수업에 포함시키게 된 계기, 그리고 올해 본격적으로 진행하고 있는 파이썬으로 공교육을 해킹하려는 도전기를 공유하고자 합니다.',
            },
        ],
    },
    {
        'name': 'Computer Vision',
        'pagebreak': True,
        'sessions': [
            {
                'name': '동물 홍채인식부터 서버까지 python으로 만들기',
                'speaker': '정진성',
                'id': 'niceutra2',
                'date': '8월 19일',
                'time': '11:00 - 11:40',
                'location': '103',
                'level': 2,
                'desc': 'Python으로 홍채인식부터 서버까지 만들어본 경험을 통해 Python으로 많은 것을 할 수 있다는 점을 공유하려 합니다. ',
            },
            {
                'name': '3D 그래픽, 그 안에서의 Python',
                'speaker': '하호준',
                'id': 'hojunlife',
                'date': '8월 19일',
                'time': '14:50 - 15:30',
                'location': '103',
                'level': 1,
                'desc': '3D Graphic Software인 Autodesk Maya에서 Python을 사용하는 것에 대한 발표입니다. 3D Graphic 작업과 Programming을 함께하는 Lookdev&Lighting Technical Director로 일하면서의 경험들을 공유하고자 합니다.',
                'css': 'word-break: break-all',
            },
        ],
    },
    {
        'name': 'Robotics / Embedded System',
        'sessions': [
            {
                'name': 'Python으로 구현한 모바일 로봇 지능',
                'speaker': '하규태',
                'id': 'gted221',
                'date': '8월 19일',
                'time': '11:00 - 11:40',
                'location': '104',
                'level': 2,
                'desc': '이동형 로봇 시스템을 만드는데 Python이 어떻게 활용되었고, 시스템을 구성하는데 어떤 장점을 가지는지에 대한 경험을 공유합니다. 1) behavior tree라는 plan execution model을 이용하여 여러가지 로봇 핵심 알고리즘들을 체계적으로 실행함으로써 주어진 목표를 달성하는 방식과 2) 단순한 plan execution을 넘어서 분산형 시스템을 도입하여 로봇 지능 모듈 집합체를 구현한 방식에 대한 사례 공유입니다.',
            },
            {
                'name': 'Python으로 나만의 IOT 구축하기',
                'speaker': '박상우',
                'id': 'tkddn0916',
                'date': '8월 19일',
                'time': '15:40 - 16:20',
                'location': '103',
                'level': 1,
                'desc': 'MicroPython + Nodemcu를 이용한 센서별 노드를 만들고 FAN, Cartridge Heater를 이용하여 최적의 온, 습도를 만들고 미세먼지를 최소화하는 방법과 라즈베리파이를 이용하여 각 노드를 제어하고 외부(Telegram Bot)와 통신하는 과정을 소개합니다.',
            },
        ],
    },
    {
        'name': 'Data Gathering',
        'sessions': [
            {
                'name': '파이썬으로 학생 들여다보기',
                'speaker': '박윤곤',
                'id': 'hahafree12',
                'date': '8월 18일',
                'time': '15:50 - 16:30',
                'location': '104',
                'level': 2,
                'desc': '교육 분야에서 최근 언급되는 학습분석(Learning Analytics)은, 학생들의 학습 과정에서 발생한 데이터를 분석하여 학습에 도움을 주기 위한 것입니다. 이러한 데이터는 다양한 소스에서 만들 수 있지만, 표현 방법이 서로 다릅니다. 이 발표에서는 이러한 학습 데이터를 일관성 있게 만들고, 관리하고, 분석하기 위한 방법을 소개하고자 합니다. ',
            },
            {
                'name': '온라인 뉴스 댓글은 정말 사람들의 목소리일까?',
                'speaker': '이준범',
                'id': 'beomi',
                'date': '8월 19일',
                'time': '11:00 - 11:40',
                'location': '102',
                'level': 1,
                'desc': '인터넷 뉴스 기사 댓글란을 보다보면 기사 내용과는 전혀 무관한, 그리고 반복적인 댓글이 종종 보입니다. 이 세션에서는 이런 댓글들 분석하기 위해 사용된 데이터 수집과 저장, 분석의 방법과 그 결과를 공유합니다.',
            },
        ],
    },
    {
        'name': 'Blockchain',
        'pagebreak': True,
        'sessions': [
            {
                'name': 'Python in Chains: Running Python Code for IoT Projects on a custom-built Blockchain Network',
                'speaker': 'Daniel Hong',
                'id': 'shhong',
                'date': '8월 19일',
                'time': '14:00 - 14:40',
                'location': '103',
                'language': 'English',
                'level': 3,
                'desc': '파이썬 코드를 Ethereum 블록체인에서 구동될 수 있는 Smart Contract로 구동할 수 있도록 하는 삽질의 여정을 소개합니다. 목적에 맞도록 수정된 파이썬 런타임과 Ethereum Virtual Machine (EVM) 소프트웨어를 구현하고, 이를 사용하여 블록체인 기반의 가정 IoT 네트워크 위에서 파이썬 언어로 작성된 Smart Contract 코드를 작성하는 것에 관하여 다룹니다.',
            },
            {
                'name': '네코유메: 파이썬으로 만든 블록체인 기반 롤플레잉 게임',
                'speaker': '김재석',
                'id': 'jckdotim',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '202',
                'level': 3,
                'desc': '네코유메(https://nekoyu.me/)는 파이썬으로 개발한 블록체인 기반 롤플레잉 게임입니다. 게임에 특화된 블록체인이 필요했기에, 기존 퍼블릭 체인을 포크하지 않고 직접 블록체인을 개발하였습니다.',
            },
        ],
    },
    {
        'name': 'Python Community',
        'pagebreak': True,
        'sessions': [
            {
                'name': '그렇게 커미터가 된다: Python을 통해 오픈소스 생태계 가르치기',
                'speaker': '신정규',
                'id': 'inureyes',
                'date': '8월 19일',
                'time': '15:40 - 16:20',
                'location': '105',
                'level': 1,
                'desc': '오픈소스 소프트웨어 대학 교육 과정을 설계하고 2년간 강의하며 겪은 다양한 경험을 Python 언어를 중심으로 다룹니다. 교과 과정이 지향하는 바는 프로그래밍과 오픈소스 문화이며, 이를 반영한 교육 과정 설계 시 주의한 점들과, 2년간의 경험 끝에 잘못 생각한 것으로 판단하게 된 몇가지에 대해 간단히 소개합니다.',
            },
            {
                'name': 'A Spark for Diversity: A Walk-through of Women Who Code Manila’s Python Study Group',
                'speaker': 'Nicole I. Tibay',
                'id': 'neequole',
                'date': '8월 19일',
                'time': '10:00 - 10:25',
                'location': '102',
                'language': 'English',
                'level': 1,
                'desc': 'Women Who Code is a global non-profit organization dedicated to inspiring women to excel in technology careers. Last year, Women Who Code Manila was launched to extend this goal to Filipinas. We held study groups every month to help achieve this goal. In this talk, I will share my experience conducting the Python study group - the setup we have, tools we used, topics we share and how it became a tool to spark for diversity.',
            },
            {
                'name': '작은 오픈 소스 3년 운영기',
                'speaker': '박아윤',
                'id': 'iamparkayun',
                'date': '8월 19일',
                'time': '14:00 - 14:25',
                'location': '102',
                'level': 2,
                'desc': 'BSON 파이썬 구현체 프로젝트를 어떻게 시작하게 되었고, 어떻게 진행중이며, 어떻게 구현되었는지에 대하여 공유합니다. 파이썬은 어느정도 알고 있으며, 오픈 소스를 시작하고 싶은데 어떻게 해야하는지 알고싶은 분들이 들으시면 좋을 것 같습니다.',
            },
            {
                'name': 'Ready, Get Set, Go!',
                'speaker': '김영근',
                'id': 'iamyounggunkim',
                'date': '8월 19일',
                'time': '14:50 - 15:30',
                'location': '105',
                'level': 1,
                'desc': '스프린트에 대한 모든 것을 다룹니다. 역사와 의의를 비롯하여 커뮤니티에 미친 구체적인 영향과 국내에서의 상황을 포함합니다. 참가자가 알아야 할 내용과 운영자가 알아야 할 내용에 대해서도 다룹니다. 이슈 헌팅, 포크, PR 작성, 리뷰 내용 적용, PR 업데이트 등 스텝바이스텝 가이드도 포함합니다. 국내외 스프린트 참가 경험과 운영 경험 그리고 그 성과를 공유하여 더 많은 스프린트가 활성화되고 나아가 참가자/운영자 모두가 더 나은 스프린트 경험을 할 수 있게 돕는 것이 발표의 목적입니다.',
            },
            {
                'name': 'How Python Saved My Life',
                'speaker': 'Doni Rubiagatra',
                'id': 'doni_rubiagatra',
                'date': '8월 19일',
                'time': '15:40 - 16:05',
                'location': '102',
                'language': 'English',
                'level': 1,
                'desc': 'This session describes how my life have been evolved by Python, just in three years. From GPA 0 student to become a mentor in Data Science Indonesia.',
            },
            {
                'name': 'Journey of a Python community from 3 to 3000+ members',
                'speaker': 'Manoj Pandey',
                'id': 'manojpandey1996',
                'date': '8월 19일',
                'time': '13:10 - 13:35',
                'location': '102',
                'language': 'English',
                'level': 1,
                'desc': 'This talk will briefly talk about how we setup and grow PyData in my city and challenges.',
            },
        ],
    },
    {
        'name': 'Web Service',
        'sessions': [
            {
                'name': '40만명이 쓰는 Django channels 채팅서버, 우리는 어떻게 만들었나?',
                'speaker': '손은주',
                'id': '5on_3un_7oo',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '202',
                'level': 2,
                'desc': '많이 사용되고 있는 Django의 프로젝트임에도 상대적으로 알려지지 않은 Channels를 소개하고 싶습니다. 최근에 Channels2가 릴리즈 되었기 때문에 좋은 타이밍이라고 생각합니다.',
            },
            {
                'name': '레거시 시스템에 Django 들이밀기',
                'speaker': '정지용',
                'id': 'bwhite8129',
                'date': '8월 19일',
                'time': '13:10 - 13:35',
                'location': '103',
                'level': 2,
                'desc': '크고 아름다운 Java 기반의 레거시 시스템. 하지만 매일 같이 반복되는 Java 코드를 찍어내기에 지쳤다면? 레거시 시스템에 Django를 들이밀어 한DB 두살림을 구축해보자. 아 그거 inspectdb 하나만 쓰면 되는 거 아닌가? 크고 작은 삽질들을 모아모아 공유합니다.',
            },
            {
                'name': 'Sanic를 활용하여 Microservice 구축하기',
                'speaker': '이재면',
                'id': 'jake',
                'date': '8월 18일',
                'time': '13:00 - 13:25',
                'location': '103',
                'level': 2,
                'desc': '왜 많은 회사들이 Monolithic application에서 Microservices architecture로 전환하는지 생각해볼 수 있는 기회를 제공하려 합니다. 아직 Sanic이라는 프레임워크가 낯선 청중에게는 Aysnc/await syntax를 활용하여 쉽게 Async request를 처리할 수 있는 것을 소개하고 추후에 활용할 수 있는 옵션이 되길 바랍니다.',
                'css': 'word-break: break-all',
            },
            {
                'name': '2to3 converter를 활용한 django 프로젝트 python 버전업 삽질기',
                'speaker': '남형걸',
                'id': 'royce',
                'date': '8월 18일',
                'time': '15:50 - 16:30',
                'location': '202',
                'level': 2,
                'desc': 'Python 2에서 3으로의 전환 작업의 경위를 상세히 소개하고, 시행착오 끝에 best practice라고 생각할만한 부분들을 제안합니다. 이 과정에서 파이썬의 encoding과 urllib에 대한 개념과 런타임 버전별 차이에 대해서 자세하게 이해하게 되어, 이를 정리하여 전달합니다.',
            },
            {
                'name': 'Callosum: An RPC Tranport Library',
                'speaker': '김준기',
                'id': 'joongi',
                'date': '8월 19일',
                'time': '15:40 - 16:20',
                'location': '101',
                'level': 3,
                'desc': '본 발표에서는 asyncio용 ZeroMQ 바인딩 라이브러리인 aiozmq보다 더 강력한 기능과 함께 이를 대체하고자 직접 개발한 Callosum RPC Transport 라이브러리를 소개합니다. Callosum은 단순함을 목표로 설계되었고 암호화된 통신을 기반으로 대용량 스트리밍과 사용자가 선택한 IDL 기반의 메시징을 동시에 지원합니다.',
            },
            {
                'name': 'Django ORM 조금 더 깊게 살펴보기',
                'speaker': '한섬기',
                'id': 'iandmyhand',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '202',
                'level': 2,
                'desc': '본 발표에서는 실무에서 맞닥뜨렸던 다양한 문제들을 Django의 ORM을 최대한 활용하여 해결했던 방법들을 공유합니다. 예를 들어 Django ORM에서 제공하지 않는 custom function을 활용하는 방법, transaction을 정확히 다루는 방법, ORM을 써보려는 개발자들을 괴롭히는 다양한 group by 절 사용방법, 간단한 Performance Tuning 등을 다룹니다.',
            },
            {
                'name': 'PyQt로 만드는 웹기반 데스크탑 어플리케이션',
                'speaker': '임덕규',
                'id': 'hong18s',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '103',
                'level': 2,
                'desc': '최근 Javascript 진영의 눈부신 발전으로 ‘Electron’과 ‘React Native’ 등 Web Framework를 이용하여 데스크탑에서 사용할 수 있는 어플리케이션을 만들어내는 경지에 이르렀습니다. Python과 Web Framework을 이용하여 어떻게 Web의 데스크탑 프로그램을 만들 수 있는지에 대해 발표합니다.',
            },
        ],
    },
    {
        'name': 'Deep Learning & AI',
        'pagebreak': True,
        'sessions': [
            {
                'name': '딥러닝을 이용한 로그 기반의 게임 AI 개발',
                'speaker': '김선태',
                'id': 'suntae_kim',
                'date': '8월 18일',
                'time': '14:40 - 15:20',
                'location': '104',
                'level': 1,
                'desc': '게임에서 AI는 빠질 수 없는 기능으로 그동안 다양한 장르와 플랫폼에서 사용되어 왔습니다. 게임에서 발생하는 다양한 경우의 수를 로직으로 구현하지 않고 사용자가 플레이했던 데이터를 이용하여 학습시켜보면 어떨까요? 이 발표에서는 로그 기반의 게임 AI가 개발되는 과정에서 파이썬이 어떻게 활용되었는지 살펴보고, 그 동안 겪었던 문제와 해결 방법에 대해서 공유하고자 합니다.',
            },
            {
                'name': '소설 쓰는 딥 러닝',
                'speaker': '조용래',
                'id': 'dreamgonfly',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '104',
                'level': 2,
                'desc': '일반적인 딥 러닝 모델은 짧은 맥락 만을 고려하는 챗봇이나 번역에는 적합하지만 소설에는 적합하지 않았습니다. 소설 쓰는 인공 지능 모델을 만들기 위한 고민과 경험을 공유하고 한국어 텍스트 자동 생성을 고민하는 사람들이나, 게임에서 유저와 인터렉션하며 게임 스토리가 만들어지도록 하고 싶은 게임 개발자들, 또는 TensorFlow나 PyTorch를 이용하여 딥러닝 모델을 만들어보고 싶은 프로그래머 등에게 도움이 되고자 합니다.',
            },
            {
                'name': '인공지능 슈퍼마리오의 거의 모든것',
                'speaker': '정원석',
                'id': 'wonseokjung',
                'date': '8월 19일',
                'time': '10:00 - 10:40',
                'location': '104',
                'level': 2,
                'desc': '사람이 정답을 알려주지 않아도 스스로 경험하며 목적을 달성하는 행동은 어떻게 진행될까요? 심층 강화학습을 이용해 장애물과 적을 피하며 목적을 달성하는 슈퍼마리오를 만들었습니다. 깃발을 잡는 슈퍼마리오의 과정을 재미있는 예제와 약간의 수학 수식을 통해 알려드릴 예정입니다.',
            },
        ],
    },
    {
        'name': 'Python Core & Fundamental',
        'pagebreak': True,
        'sessions': [
            {
                'name': '파이썬에 switch문 넣기 : 새 구문을 만들면서 배우는 파이썬 내부',
                'speaker': '성우경',
                'id': 'ukysung',
                'date': '8월 19일',
                'time': '10:00 - 10:40',
                'location': '101',
                'level': 3,
                'desc': '파이썬에는 존재하지 않지만 다른 언어에 쓰이고 있는 switch문/패턴매칭 기능을 파이썬 인터프리터 내부에서 구현하는 방법에 대한 발표입니다.  CPython 소스코드 수정과 switch문 추가를 통하여 파이썬 내부를 살펴봅니다.',
            },
            {
                'name': '추천 시스템을 위한 어플리케이션 서버 개발 후기 @ kakao',
                'speaker': '김광섭',
                'id': 'mrkwangsub',
                'date': '8월 19일',
                'time': '11:00 - 11:40',
                'location': '101',
                'level': 2,
                'desc': 'Python3.6+/Asyncio(Sanic)를 사용해 어플리케이션 서버를 개발한 후기입니다. 서비스에 직접 노출되기 때문에 많은 양의 쿼리를 낮은 지연으로 안정적으로 처리할 수 있고, 서비스 확장 및 트래픽 집중에 쉽게 대응할 수 있도록 수평 확장에 용이한 구조가 필요했습니다. 간단한 추천 시스템에 대한 지식과 대용량 어플리케이션 서버 구성에 대한 조금의 노하우를 얻어갈 수 있는 발표가 될 것으로 기대합니다.',
            },
            {
                'name': 'Deep Dive into Coroutine',
                'speaker': '김대희',
                'id': 'zsaladinz',
                'date': '8월 18일',
                'time': '15:50 - 16:30',
                'location': '101',
                'level': 3,
                'desc': '코루틴의 내부 구현과 이벤트 루프 동작 원리를 다루면서 인터프리터 내부 (바이트 코드 동작 원리, 데이터 스택, 콜 스택, 코드 객체, 프레임 객체 등)에 대해 발표합니다. 또한 이벤트 루프를 만들어 보며 코루틴과 어떤 식으로 상호작용하는지, 비동기 I/O를 어떤 식으로 처리하는 지 알아봅니다.',
            },
            {
                'name': 'Pythonic code가 과연 효율적일까?',
                'speaker': '안주은',
                'id': 'jflow',
                'date': '8월 19일',
                'time': '14:55 - 15:20',
                'location': '101',
                'level': 1,
                'desc': '발표는 어떻게 CPU time과 Memory 사용량을 측정했는지로 시작해 Collection, Deviation, Copying lists 들에 있어 어떤 코딩 스타일이 유리한지 알아보고, 느꼈던 생각들을 나누어 보려합니다.',
            },
        ],
    },
    {
        'name': 'Sponsor Sessions',
        'pagebreak': True,
        'sessions': [
            {
                'name': '학습하는 조직과 파이썬: 뱅크샐러드 사례를 중심으로',
                'speaker': '뱅크샐러드',
                'id': 'banksalad',
                'date': '8월 18일',
                'time': '13:40 - 14:20',
                'location': '103',
                'level': 1,
                'desc': '어떻게 하면 불확실성이 매우 큰 스타트업 환경에서 회색 영역을 점점 줄여나갈 수 있을까요? 뱅크샐러드는 그 답을 ‘학습하는 조직‘에서 찾았습니다. 이번 발표에서는 뱅크샐러드가 4년간 파이썬과 동고동락하며 느낀 바를 ‘조직적 학습’이라는 측면에서 조망하려 합니다.',
            },
            {
                'name': '하이퍼커넥트에서 자동 광고 성과 측정 시스템 구축하기',
                'speaker': '박승호 (하이퍼커넥트)',
                'id': 'eugene',
                'date': '8월 18일',
                'time': '15:50 - 16:30',
                'location': '103',
                'level': 1,
                'desc': '하이퍼커넥트에서는 아자르 영상메신저를 200개가 넘는 국가에서 서비스하면서, 국가별로 수 많은 마케팅을 진행하고 있습니다. 광고 최적화를 위해, 광고 및 유저 관련 데이터를 수집하는 과정부터, 통계 모델을 이용해서 LTV(Lifetime Value)를 예측하는 과정까지, 자동으로 광고의 성과를 측정하고 최적화하기 위해 시스템을 구축하는 과정에 대해서 다룹니다.',
            },
            {
                'name': '파이썬으로 암을 찾아보자: 데이터로 만드는 의학 이야기',
                'speaker': '백승욱 (루닛)',
                'id': 'apaek',
                'date': '8월 19일',
                'time': '10:00 - 10:40',
                'location': '103',
                'level': 1,
                'desc': '(내용 미정)',
            },
        ],
    },
]

